In [2]:
import pandas as pd

df = pd.DataFrame(columns=['Name', 'Height', 'Weight'])

In [3]:
df

Empty DataFrame
Columns: [Name, Height, Weight]
Index: []

In [4]:
df.loc[0] = ['Allen', '175', '75']

In [5]:
df

    Name Height Weight
0  Allen    175     75

In [6]:
df.loc[1] = ['Ted', '180', '80']
df

    Name Height Weight
0  Allen    175     75
1    Ted    180     80

In [7]:
df['age'] = ['22', '23']

In [8]:
df

    Name Height Weight age
0  Allen    175     75  22
1    Ted    180     80  23

In [9]:
df.drop(['age'], axis=1)

    Name Height Weight
0  Allen    175     75
1    Ted    180     80

In [10]:
df

    Name Height Weight age
0  Allen    175     75  22
1    Ted    180     80  23

In [11]:
df = df.drop(['age'], axis=1)

In [12]:
df

    Name Height Weight
0  Allen    175     75
1    Ted    180     80

In [13]:
df.drop(1)

    Name Height Weight
0  Allen    175     75

In [14]:
df = df.drop(1)

In [15]:
df

    Name Height Weight
0  Allen    175     75

In [16]:
df2 = df

In [17]:
df2

    Name Height Weight
0  Allen    175     75

In [18]:
df

    Name Height Weight
0  Allen    175     75

In [19]:
df2.loc[1] = 123

In [20]:
df2

    Name Height Weight
0  Allen    175     75
1    123    123    123

In [21]:
df

    Name Height Weight
0  Allen    175     75
1    123    123    123

In [22]:
df3 = df.copy()

In [23]:
df3 = df3.drop(1)
df3

    Name Height Weight
0  Allen    175     75

In [24]:
df

    Name Height Weight
0  Allen    175     75
1    123    123    123

In [27]:
df.to_csv('./test.csv', index=0, header=None)

In [30]:
df2 = pd.read_csv('./test.csv', header=None)
df2

       0    1    2
0  Allen  175   75
1    123  123  123

In [31]:
df2.columns = ['Name', 'Height', 'Weight']
df2

    Name  Height  Weight
0  Allen     175      75
1    123     123     123

In [32]:
columns = ['Name', 'Height', 'Weight']
data = [
    ['Allen', '175', '75'],
    ['Ted', '180', '80']
]
df3 = pd.DataFrame(data=data, columns=columns)

In [33]:
df3

    Name Height Weight
0  Allen    175     75
1    Ted    180     80